{
  "basics": {
    "name": "Taha Shaheen",
    "email": "taha.shaheen@asu.edu",
    "url": "https://tahashaheen.github.io/",
    "summary": "Ph.D. student in Computer Science at Arizona State University working on human-robot collaboration with 3+ years of research experience. Background in engineering low-cost socially assistive robots for autism therapy, prevention of misuse of teleoperated robots, and studies involving human-robot interaction.",
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "taha-shaheen",
        "url": "https://www.linkedin.com/in/taha-shaheen"
      }
    ]
  },
  "education": [
    {
      "institution": "Arizona State University",
      "location": "Tempe, AZ, USA",
      "url": "https://www.asu.edu/",
      "area": "Computer Science",
      "studyType": "Ph.D.",
      "startDate": "2023-08-01",
      "endDate": "2028-05-01",
      "score": "4.0/4.0",
      "courses": [],
      "advisors": ["Yu \"Tony\" Zhang"]
    },
    {
      "institution": "Kyoto University",
      "location": "Kyoto, Japan",
      "url": "https://www.kyoto-u.ac.jp/en/",
      "area": "Social Informatics",
      "studyType": "Master of Informatics",
      "startDate": "2021-04-01",
      "endDate": "2023-03-01",
      "score": "3.92/4.0 (Calculated)",
      "courses": [],
      "advisors": ["Dražen Brščić", "Takayuki Kanda"],
      "awards": ["Distinguished Master's Thesis Award in Feb 2023"]
    },
    {
      "institution": "NED University of Engineering and Technology",
      "location": "Karachi, Pakistan",
      "url": "https://www.neduet.edu.pk/",
      "area": "Electronic Engineering",
      "studyType": "Bachelor of Engineering",
      "startDate": "2013-09-01",
      "endDate": "2017-11-01",
      "score": "3.698/4.0",
      "courses": [],
      "rank": "5 in batch of 142"
    }
  ],
  "publications": [
    {
      "name": "Investigation of Low-Moral Actions by Malicious Anonymous Operators of Avatar Robots",
      "publisher": "ACM Transactions on Human-Robot Interaction",
      "releaseDate": "Under review",
      "url": "N/A",
      "summary": "Avatar robots allow a teleoperator to interact with the people and environment of a remote place. Malicious operators can use this technology to perpetrate malicious or low-moral actions. In this study, we used hazard identification workshops to identify low-moral actions that are possible through the locomotor movement, cameras, and microphones of an avatar robot. We conducted three workshops, each with four potential future users of avatars, to brainstorm possible low-moral actions. As avatars are not yet widespread, we gave participants experience with this technology by having them control both a simulated avatar and a real avatar as a malicious anonymous operator in a variety of situations. They also experienced sharing space with an avatar controlled by a malicious anonymous operator. We categorized the ideas generated from the workshops using affinity diagram analysis and identified four major categories: violate privacy and security, inhibit, annoy, and destroy or hurt. We also identified subcategories for each. In the second half of this study, we discuss all low-moral action subcategories in terms of their detection, mitigation, and prevention by studying literature from autonomous, social, teleoperated, and telepresence robots as well as other fields where relevant.",
      "authors": ["Shaheen, T.", "Brščić, D.", "Kanda, T."]
    }
  ],
  "work": [
    {
      "name": "School of Computing and Augmented Intelligence, Arizona State University",
      "position": "Graduate Teaching Associate",
      "url": "https://scai.engineering.asu.edu/",
      "startDate": "2023-08-01",
      "endDate": "2023-08-01",
      "summary": "Taught lectures and helped undergraduate students with study material, programming exercises, and technical issues for CSE 230 Computer Organization and Assembly Language Programming class.",
      "highlights": []
    },
    {
      "name": "Human-Robot Interaction Lab, Kyoto University",
      "position": "Graduate Researcher",
      "url": "https://www.robot.soc.i.kyoto-u.ac.jp/en/",
      "startDate": "2020-10-01",
      "endDate": "2023-08-01",
      "summary": "Investigated misuse of avatar robots by anonymous malicious operators. Designed and executed hazard-identification workshops with users to generate a taxonomy of possible low-moral actions. Wrote and submitted manuscript which proposed detection and prevention mechanisms for each low-moral action.",
      "highlights": [],
      "advisors": ["Dražen Brščić", "Takayuki Kanda"]
    },
    {
      "name": "Department of Social Informatics, Kyoto University",
      "position": "Graduate Teaching Assistant",
      "url": "https://www.soc.i.kyoto-u.ac.jp/en/",
      "startDate": "2022-04-01",
      "endDate": "2022-07-01",
      "summary": "Helped graduate students with study material, programming exercises, technical issues, and final class project for Information System Analysis class. Covered basic machine learning and data mining.",
      "highlights": []
    },
    {
      "name": "Empowerment Program, ISA",
      "position": "Group Leader",
      "url": "https://www.isa.ac.jp/en/",
      "startDate": "2021-11-01",
      "endDate": "2022-08-01",
      "summary": "Lead groups of Japanese high school students in intensive programs designed to improve their English speaking, presentation, and discussion skills. Topics included the UN's Sustainable Development Goals, positive thinking, technology, personal identity, diversity, and critical thinking.",
      "highlights": []
    },
    {
      "name": "National Center for AI, NED University of Engineering and Technology",
      "position": "Research Assistant",
      "url": "https://ncai.neduet.edu.pk/",
      "startDate": "2018-11-01",
      "endDate": "2020-09-01",
      "summary": "Engineered two low-cost socially assistive robots and investigated their use in autism therapy. Collaborated with Center for Autism, Rehabilitation & Training Sindh (C-ARTS), Dow Institute of Physical Medicine and Rehabilitation (Dow-IPMR), and Center for Autism Karachi. Guided 12 undergraduate engineering students whose final-year projects were associated with robotics and autism.",
      "highlights": []
    }
  ],
  "volunteer": [
    {
      "organization": "IROS 2022, Kyoto, Japan",
      "position": "Volunteer Assistant",
      "url": "https://www.iros2022.org/",
      "startDate": "2022-10-01",
      "endDate": "2022-10-31",
      "summary": "Helped organizers during the pre-planning phase and set up PCs and Zoom Webinars for online streaming of the conference. Assisted session chairs and speakers, and handled the functioning of equipment and computers during the conference.",
      "highlights": []
    },
    {
      "organization": "ROSCon 2022, Kyoto, Japan",
      "position": "Volunteer Assistant",
      "url": "https://roscon.ros.org/2022/",
      "startDate": "2022-10-01",
      "endDate": "2022-10-31",
      "summary": "Helped organizers set up the welcome booth. Guided participants, exhibitors, and speakers.",
      "highlights": []
    },
    {
      "organization": "WAK Japan, Kyoto, Japan",
      "position": "International Student/Guide",
      "url": "https://wakjapan.com/",
      "startDate": "2022-05-01",
      "endDate": "2023-08-31",
      "summary": "Guided Japanese high school students hailing from different prefectures of Japan through tours in Kyoto. Interacted in English to increase students' confidence in speaking a foreign language. Introduced them to Pakistani culture. Introduced patrons of Sekai Cafe (World Cafe) in Kyoto to Pakistani culture, traditions, language, and clothing through presentations and conversations.",
      "highlights": []
    },
    {
      "organization": "1947 Partition Archive and Stanford University Libraries",
      "position": "Field Officer",
      "url": "https://www.1947partitionarchive.org/",
      "startDate": "2019-03-01",
      "endDate": "2020-04-30",
      "summary": "Supervised and assisted three volunteers in rural Sindh and Karachi in recording and preserving the life stories and oral histories of witnesses of the 1947 Partition of British India. Collectively recorded 90 stories.",
      "highlights": []
    },
    {
      "organization": "1947 Partition Archive",
      "position": "Oral History Apprentice",
      "url": "https://www.1947partitionarchive.org/",
      "startDate": "2016-04-01",
      "endDate": "2017-07-31",
      "summary": "Located and interviewed 83 witnesses of the 1947 Partition of British India to preserve their life stories and oral histories. Organized two events called Voices of Partition where witnesses and survivors of the 1947 Partition told their stories. First was at Habib University in Karachi and the second was at Sindh Rural Support Organization in Sukkur. Also spoke about my personal experience of recording these life stories at these events. Interviewed by BBC Radio for my volunteer work.",
      "highlights": ["The documentary titled 'Pakistan, Partition And The Present' can be found at: https://www.bbc.co.uk/mediacentre/proginfo/2017/32/the-documentary-pakistan-partition-and-the-present and https://www.bbc.co.uk/programmes/p05b70f4"]
    }
  ],
  "awards": [
    {
      "title": "Distinguished Master's Thesis Award",
      "date": "2023",
      "awarder": "Kyoto University",
      "url": "https://www.soc.i.kyoto-u.ac.jp/en/news/785/",
      "summary": "The Distinguished Master's Thesis Award is an award given by the Graduate School of Informatics, Kyoto University, to recognize the outstanding achievements of master's students in their research. The award is based on the quality and originality of the thesis, as well as the academic contribution and social impact of the research."
    },
    {
      "title": "MEXT (文部科学省) Research Scholarship",
      "date": "2020",
      "awarder": "Japanese government",
      "url": "https://www.mext.go.jp/en/policy/education/highered/title02/detail02/sdetail02/1373897.htm",
      "summary": "The Ministry of Education, Culture, Sports, Science and Technology (MEXT) offers scholarships to international students who wish to study in graduate courses at Japanese universities as research students under the Japanese Government (MEXT) Scholarship Program."
    },
    {
      "title": "Final Year Project Grant",
      "date": "2017",
      "awarder": "Naim Siddique Final Year Project Fund",
      "url": "N/A",
      "summary": "The Naim Siddique Final Year Project Fund is a fund established by the NED Alumni Association at Southern California to support the final year projects of undergraduate engineering students at NED University of Engineering and Technology. The fund grants 10,000 USD annually to ten teams for best proposals and on recommendation of faculty project advisor."
    }
  ],
  "certificates": [],
  
  "skills": [],
  "languages": [
    {
      "language": "Urdu",
      "fluency": "Native speaker",
      "icon": ""
    },
    {
      "language": "English",
      "fluency": "Fluent",
      "icon": ""
    }
  ],
  "interests": [],
  "references": [],
  "projects": []
}
